{-# OPTIONS --rewriting #-}

module Glued.CwF where

open import StrictLib hiding (id; _∘_)
import Syntax as S
import WeakMorphism as F

infixl 5 _▶_
infixl 7 _[_]T
infixl 5 _,s_
infix  6 _∘_
infixl 8 _[_]t
infixl 5 _^_

--------------------------------------------------------------------------------

Tyᴹ : ∀ {i} → Set i → Set (suc i)
Tyᴹ {i} A = A → Set i

infixl 5 _▶ᴹ_
_▶ᴹ_ : ∀ {i j}(A : Set i)(B : A → Set j) → Set (i ⊔ j)
A ▶ᴹ B = Σ A B

--------------------------------------------------------------------------------

Con : ∀ i → S.Con i → Set (suc i)
Con i Γˢ = Tyᴹ (F.Con Γˢ)

Ty  : ∀ {j}{Γˢ : S.Con j}(Γ : Con j Γˢ) i → S.Ty Γˢ i → Set (suc i ⊔ j)
Ty {j}{Γˢ} Γ i Aˢ = (Γᶠ : F.Con Γˢ)(Γᴾ : Γ Γᶠ) → F.Ty Aˢ Γᶠ → Set i
                 -- Tyᴹ (F.Con Γˢ ▶ᴹ Γ ▶ᴹ ?)
                 -- it's much nicer to go full internal

∙ : Con zero S.∙
∙ _ = ⊤

_▶_   : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
          {j}{Aˢ : S.Ty Γˢ j}(A : Ty Γ j Aˢ)
           → Con (i ⊔ j) (Γˢ S.▶ Aˢ)
_▶_ {i}{Γˢ} Γ {j} {Aˢ} A ΓAᶠ = let Γᶠ , Aᶠ = F.▶→ ΓAᶠ in Σ (Γ Γᶠ) λ Γᴾ → A Γᶠ Γᴾ Aᶠ

Sub   : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
          {j}{Δˢ : S.Con j}(Δ : Con j Δˢ)
          → S.Sub Γˢ Δˢ → Set (i ⊔ j)
Sub {i}{Γˢ} Γ {j}{Δˢ} Δ σˢ = (Γᶠ : F.Con Γˢ)(Γᴾ : Γ Γᶠ) → Δ (F.Sub σˢ Γᶠ)

Tm  : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
          {j}{Aˢ : S.Ty Γˢ j}(A : Ty Γ j Aˢ) → S.Tm Γˢ Aˢ → Set (i ⊔ j)
Tm {i}{Γˢ} Γ {j}{Aˢ} A tˢ = (Γᶠ : F.Con Γˢ)(Γᴾ : Γ Γᶠ) → A Γᶠ Γᴾ (F.Tm tˢ Γᶠ)

_[_]T :
  ∀ {i}{Δˢ : S.Con i}   {Δ : Con i Δˢ}
    {j}{Aˢ : S.Ty Δˢ j} (A : Ty Δ j Aˢ)
    {k}{Γˢ : S.Con k}   {Γ : Con k Γˢ}
    {σˢ : S.Sub Γˢ Δˢ}  (σ : Sub Γ Δ σˢ)
    → Ty Γ j (Aˢ S.[ σˢ ]T)
_[_]T {i}{Δˢ}{Δ}{j}{Aˢ} A {k}{Γˢ}{Γ}{σˢ} σ Γᶠ Γᴾ Aᶠ = A (F.Sub σˢ Γᶠ) (σ Γᶠ Γᴾ) Aᶠ

id : ∀{i}{Γˢ : S.Con i}{Γ : Con i Γˢ} → Sub Γ Γ S.id
id {i}{Γˢ}{Γ} Γᶠ Γᴾ = Γᴾ

_∘_ :
  ∀{i}{θˢ : S.Con i}     {θ : Con _ θˢ}
   {j}{Δˢ : S.Con j}     {Δ : Con _ Δˢ}
      {σˢ : S.Sub θˢ Δˢ} (σ : Sub θ Δ σˢ)
   {k}{Γˢ : S.Con k}     {Γ : Con _ Γˢ}
      {δˢ : S.Sub Γˢ θˢ} (δ : Sub Γ θ δˢ)
  → Sub Γ Δ (σˢ S.∘ δˢ)
_∘_ {i}{θˢ}{θ}{j}{Δˢ}{Δ}{σˢ} σ {k}{Γˢ}{Γ}{δˢ} δ Γᶠ Γᴾ = σ (F.Sub δˢ Γᶠ) (δ Γᶠ Γᴾ)

ε : ∀{i}{Γˢ : S.Con i}{Γ : Con i Γˢ}
    → Sub Γ ∙ S.ε
ε {i}{Γˢ}{Γ} Γᶠ Γᴾ = tt

_,s_ :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level}
  {Δˢ : S.Con j} {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ}
  (σ : Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ) {k : Level} {Aˢ : S.Ty {j} Δˢ k}
  {A : Ty {j} {Δˢ} Δ k Aˢ}
  {tˢ : S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} →
  Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ}
  (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ →
  Sub {i} {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ}
  (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A)
  (S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k} {Aˢ} tˢ)
_,s_ {i}{Γˢ}{Γ}{j}{Δˢ}{Δ}{σˢ} σ {k}{Aˢ}{A}{tˢ} t Γᶠ Γᴾ = σ Γᶠ Γᴾ , t Γᶠ Γᴾ

π₁ :
  ∀{i}{Γˢ : S.Con i}                {Γ : Con _ Γˢ}
   {j}{Δˢ : S.Con j}                {Δ : Con _ Δˢ}
   {k}{Aˢ : S.Ty Δˢ k}              {A : Ty Δ _ Aˢ}
      {σˢ : S.Sub Γˢ (Δˢ S.▶ Aˢ)}   (σ : Sub Γ (Δ ▶ A) σˢ)
  → Sub Γ Δ (S.π₁ σˢ)
π₁ {i}{Γˢ}{Γ}{j}{Δˢ}{Δ}{k}{Aˢ}{A}{σˢ} σ Γᶠ Γᴾ = ₁ (σ Γᶠ Γᴾ)

π₂ :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
   {Δ : Con j Δˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k
   Aˢ} {σˢ : S.Sub {i} Γˢ {j ⊔ k} (S._▶_ {j} Δˢ {k} Aˢ)} (σ : Sub {i}
   {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) σˢ) →
   Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} (S.π₁ {i} {Γˢ} {j}
   {Δˢ} {k} {Aˢ} σˢ)} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {S.π₁
   {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ}
   {A} {σˢ} σ)) (S.π₂ {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ)
π₂ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {σˢ} σ Γᶠ Γᴾ = ₂ (σ Γᶠ Γᴾ)

_[_]t :
  {i : Level} {Δˢ : S.Con i} {Δ : Con i Δˢ} {j : Level} {Aˢ : S.Ty {i}
  Δˢ j} {A : Ty {i} {Δˢ} Δ j Aˢ} {tˢ : S.Tm {i} Δˢ {j} Aˢ} → Tm {i} {Δˢ}
  Δ {j} {Aˢ} A tˢ → {k : Level} {Γˢ : S.Con k} {Γ : Con k Γˢ} {σˢ :
  S.Sub {k} Γˢ {i} Δˢ} (σ : Sub {k} {Γˢ} Γ {i} {Δˢ} Δ σˢ) → Tm {k} {Γˢ}
  Γ {j} {S._[_]T {i} {Δˢ} {j} Aˢ {k} {Γˢ} σˢ} (_[_]T {i} {Δˢ} {Δ} {j}
  {Aˢ} A {k} {Γˢ} {Γ} {σˢ} σ) (S._[_]t {i} {Δˢ} {j} {Aˢ} tˢ {k} {Γˢ} σˢ)
_[_]t {i} {Δˢ} {Δ} {j} {Aˢ} {A} {tˢ} t {k} {Γˢ} {Γ} {σˢ} σ Γᶠ Γᴾ = t (F.Sub σˢ Γᶠ) (σ Γᶠ Γᴾ)

∙η :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {σˢ : S.Sub {i} Γˢ {zero}
  S.∙} {σ : Sub {i} {Γˢ} Γ {zero} {S.∙} ∙ σˢ} → _≡_ {i} {Sub {i} {Γˢ} Γ
  {zero} {S.∙} ∙ (S.ε {i} {Γˢ})} (tr {i} {i} {S.Sub {i} Γˢ {zero} S.∙}
  (Sub {i} {Γˢ} Γ {zero} {S.∙} ∙) {σˢ} {S.ε {i} {Γˢ}} (S.∙η {i} {Γˢ}
  {σˢ}) σ) (ε {i} {Γˢ} {Γ})
∙η {i} {Γˢ} {Γ} {σˢ} {σ} = refl

[id]T :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Aˢ : S.Ty {i}
   Γˢ j} {A : Ty {i} {Γˢ} Γ j Aˢ} → _≡_ {i ⊔ suc j} {Ty {i} {Γˢ} Γ j Aˢ}
   (_[_]T {i} {Γˢ} {Γ} {j} {Aˢ} A {i} {Γˢ} {Γ} {S.id {i} {Γˢ}} (id {i}
   {Γˢ} {Γ})) A
[id]T = refl

[∘]T :
  {i : Level} {θˢ : S.Con i} {θ : Con i θˢ} {j : Level} {Δˢ : S.Con j}
  {Δ : Con j Δˢ} {σˢ : S.Sub {i} θˢ {j} Δˢ} {σ : Sub {i} {θˢ} θ {j} {Δˢ}
  Δ σˢ} {k : Level} {Γˢ : S.Con k} {Γ : Con k Γˢ} {δˢ : S.Sub {k} Γˢ {i}
  θˢ} {δ : Sub {k} {Γˢ} Γ {i} {θˢ} θ δˢ} {l : Level} {Aˢ : S.Ty {j} Δˢ
  l} {A : Ty {j} {Δˢ} Δ l Aˢ} → _≡_ {k ⊔ suc l} {Ty {k} {Γˢ} Γ l
  (S._[_]T {j} {Δˢ} {l} Aˢ {k} {Γˢ} (S._∘_ {i} {θˢ} {j} {Δˢ} σˢ {k} {Γˢ}
  δˢ))} (_[_]T {j} {Δˢ} {Δ} {l} {Aˢ} A {k} {Γˢ} {Γ} {S._∘_ {i} {θˢ} {j}
  {Δˢ} σˢ {k} {Γˢ} δˢ} (_∘_ {i} {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Γˢ}
  {Γ} {δˢ} δ)) (_[_]T {i} {θˢ} {θ} {l} {S._[_]T {j} {Δˢ} {l} Aˢ {i} {θˢ}
  σˢ} (_[_]T {j} {Δˢ} {Δ} {l} {Aˢ} A {i} {θˢ} {θ} {σˢ} σ) {k} {Γˢ} {Γ}
  {δˢ} δ)
[∘]T = refl

idl :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
  {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
  Δ σˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ} (_∘_ {j} {Δˢ} {Δ}
  {j} {Δˢ} {Δ} {S.id {j} {Δˢ}} (id {j} {Δˢ} {Δ}) {i} {Γˢ} {Γ} {σˢ} σ) σ
idl = refl

idr :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
  {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
  Δ σˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ} (_∘_ {i} {Γˢ} {Γ}
  {j} {Δˢ} {Δ} {σˢ} σ {i} {Γˢ} {Γ} {S.id {i} {Γˢ}} (id {i} {Γˢ} {Γ})) σ
idr = refl

ass :
  {i : Level} {θˢ : S.Con i} {θ : Con i θˢ} {j : Level} {Δˢ : S.Con j}
  {Δ : Con j Δˢ} {σˢ : S.Sub {i} θˢ {j} Δˢ} {σ : Sub {i} {θˢ} θ {j} {Δˢ}
  Δ σˢ} {k : Level} {Ξˢ : S.Con k} {Ξ : Con k Ξˢ} {δˢ : S.Sub {k} Ξˢ {i}
  θˢ} {δ : Sub {k} {Ξˢ} Ξ {i} {θˢ} θ δˢ} {l : Level} {Γˢ : S.Con l} {Γ :
  Con l Γˢ} {νˢ : S.Sub {l} Γˢ {k} Ξˢ} {ν : Sub {l} {Γˢ} Γ {k} {Ξˢ} Ξ
  νˢ} → _≡_ {j ⊔ l} {Sub {l} {Γˢ} Γ {j} {Δˢ} Δ (S._∘_ {i} {θˢ} {j} {Δˢ}
  σˢ {l} {Γˢ} (S._∘_ {k} {Ξˢ} {i} {θˢ} δˢ {l} {Γˢ} νˢ))} (_∘_ {k} {Ξˢ}
  {Ξ} {j} {Δˢ} {Δ} {S._∘_ {i} {θˢ} {j} {Δˢ} σˢ {k} {Ξˢ} δˢ} (_∘_ {i}
  {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Ξˢ} {Ξ} {δˢ} δ) {l} {Γˢ} {Γ} {νˢ} ν)
  (_∘_ {i} {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {l} {Γˢ} {Γ} {S._∘_ {k} {Ξˢ} {i}
  {θˢ} δˢ {l} {Γˢ} νˢ} (_∘_ {k} {Ξˢ} {Ξ} {i} {θˢ} {θ} {δˢ} δ {l} {Γˢ}
  {Γ} {νˢ} ν))
ass = refl

▶β₁ :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
   {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
   Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
   S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
   {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
   {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j}
   {Δˢ} Δ σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ}
   {j} {Δˢ} σˢ {k} {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k}
   {Aˢ} {A} {tˢ} t)) σ
▶β₁ = refl

▶β₂ :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
   {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
   Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
   S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
   {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
   {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} → _≡_ {i ⊔ k} {Tm {i} {Γˢ} Γ {k}
   {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A
   {i} {Γˢ} {Γ} {σˢ} σ) tˢ} (tr {i ⊔ j} {i ⊔ k} {Sub {i} {Γˢ} Γ {j} {Δˢ}
   Δ σˢ} (λ x → Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ}
   (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} x) tˢ) {π₁ {i} {Γˢ}
   {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k} {Aˢ}
   tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} {A} {tˢ} t)} {σ}
   (▶β₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} {σ} {k} {Aˢ} {A} {tˢ} {t}) (π₂ {i}
   {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k}
   {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} {A} {tˢ} t)))
   t
▶β₂ = refl

▶η :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
   {Δ : Con j Δˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k
   Aˢ} {σˢ : S.Sub {i} Γˢ {j ⊔ k} (S._▶_ {j} Δˢ {k} Aˢ)} (σ : Sub {i}
   {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) σˢ) →
   _≡_ {i ⊔ (j ⊔ k)} {Sub {i} {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_
   {j} {Δˢ} Δ {k} {Aˢ} A) σˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {S.π₁ {i}
   {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A}
   {σˢ} σ) {k} {Aˢ} {A} {S.π₂ {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₂ {i} {Γˢ}
   {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {σˢ} σ)) σ
▶η σ = refl

,∘ :
   {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
   {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
   Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
   S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
   {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
   {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} {l : Level} {θˢ : S.Con l} {θ :
   Con l θˢ} {δˢ : S.Sub {l} θˢ {i} Γˢ} {δ : Sub {l} {θˢ} θ {i} {Γˢ} Γ
   δˢ} → _≡_ {j ⊔ (k ⊔ l)} {Sub {l} {θˢ} θ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ}
   (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) (S._,s_ {l} {θˢ} {j} {Δˢ} (S._∘_ {i} {Γˢ}
   {j} {Δˢ} σˢ {l} {θˢ} δˢ) {k} {Aˢ} (S._[_]t {i} {Γˢ} {k} {S._[_]T {j}
   {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l} {θˢ} δˢ))} (_∘_ {i} {Γˢ} {Γ} {j ⊔ k}
   {S._▶_ {j} Δˢ {k} Aˢ} {_▶_ {j} {Δˢ} Δ {k} {Aˢ} A} {S._,s_ {i} {Γˢ} {j}
   {Δˢ} σˢ {k} {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ}
   {A} {tˢ} t) {l} {θˢ} {θ} {δˢ} δ) (_,s_ {l} {θˢ} {θ} {j} {Δˢ} {Δ}
   {S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ}
   {Δ} {σˢ} σ {l} {θˢ} {θ} {δˢ} δ) {k} {Aˢ} {A} {S._[_]t {i} {Γˢ} {k}
   {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l} {θˢ} δˢ} (tr {suc k ⊔ l}
   {k ⊔ l} {Ty {l} {θˢ} θ k (S._[_]T {j} {Δˢ} {k} Aˢ {l} {θˢ} (S._∘_ {i}
   {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ))} (λ x → Tm {l} {θˢ} θ {k} {S._[_]T {j}
   {Δˢ} {k} Aˢ {l} {θˢ} (S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ)} x
   (S._[_]t {i} {Γˢ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l}
   {θˢ} δˢ)) {_[_]T {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ}
   σˢ} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) {l} {θˢ} {θ}
   {δˢ} δ} {_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {l} {θˢ} {θ} {S._∘_ {i} {Γˢ}
   {j} {Δˢ} σˢ {l} {θˢ} δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {l}
   {θˢ} {θ} {δˢ} δ)} (_⁻¹ {suc k ⊔ l} {Ty {l} {θˢ} θ k (S._[_]T {j} {Δˢ}
   {k} Aˢ {l} {θˢ} (S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ))} {_[_]T {j}
   {Δˢ} {Δ} {k} {Aˢ} A {l} {θˢ} {θ} {S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ}
   δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {l} {θˢ} {θ} {δˢ} δ)} {_[_]T
   {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ}
   {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) {l} {θˢ} {θ} {δˢ} δ} ([∘]T {i}
   {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} {σ} {l} {θˢ} {θ} {δˢ} {δ} {k} {Aˢ} {A}))
   (_[_]t {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} {_[_]T
   {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ} {tˢ} t {l} {θˢ} {θ} {δˢ}
   δ)))
,∘ = refl

wk :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {k : Level}
  {Aˢ : S.Ty {i} Γˢ k} {A : Ty {i} {Γˢ} Γ k Aˢ} →
  Sub {i ⊔ k} {S._▶_ {i} Γˢ {k} Aˢ} (_▶_ {i} {Γˢ} Γ {k} {Aˢ} A) {i}
  {Γˢ} Γ (S.wk {i} {Γˢ} {k} {Aˢ})
wk {z} {z₁} {z₂} {z₃} {z₄} {z₅} =
  π₁ {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄} {_▶_ {z} {z₁} z₂ {z₃} {z₄} z₅}
  {z} {z₁} {z₂} {z₃} {z₄} {z₅} {S.id {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄}}
  (id {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄} {_▶_ {z} {z₁} z₂ {z₃} {z₄} z₅})

vz :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {k : Level} {Aˢ : S.Ty {i}
  Γˢ k} {A : Ty {i} {Γˢ} Γ k Aˢ} → Tm {i ⊔ k} {S._▶_ {i} Γˢ {k} Aˢ}
  (_▶_ {i} {Γˢ} Γ {k} {Aˢ} A) {k} {S._[_]T {i} {Γˢ} {k} Aˢ {i ⊔ k}
  {S._▶_ {i} Γˢ {k} Aˢ} (S.wk {i} {Γˢ} {k} {Aˢ})} (_[_]T {i} {Γˢ} {Γ}
  {k} {Aˢ} A {i ⊔ k} {S._▶_ {i} Γˢ {k} Aˢ} {_▶_ {i} {Γˢ} Γ {k} {Aˢ} A}
  {S.wk {i} {Γˢ} {k} {Aˢ}} (wk {i} {Γˢ} {Γ} {k} {Aˢ} {A})) (S.vz {i}
  {Γˢ} {k} {Aˢ})
vz {z} {z₁} {z₂} {z₃} {z₄} {z₅} =
  π₂ {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄} {_▶_ {z} {z₁} z₂ {z₃} {z₄} z₅}
  {z} {z₁} {z₂} {z₃} {z₄} {z₅} {S.id {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄}}
  (id {z ⊔ z₃} {S._▶_ {z} z₁ {z₃} z₄} {_▶_ {z} {z₁} z₂ {z₃} {z₄} z₅})

_^_ :
  {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
  {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} (σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
  Δ σˢ) {k : Level} {Aˢ : S.Ty {j} Δˢ k} (A : Ty {j} {Δˢ} Δ k Aˢ) → Sub
  {i ⊔ k} {S._▶_ {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} (_▶_
  {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ}
  {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ)) {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ}
  (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) (S._^_ {i} {Γˢ} {j} {Δˢ} σˢ {k} Aˢ)
_^_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} A Γᶠ Γᴾ =
  σ (₁ (F.▶→ {i} {Γˢ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} Γᶠ))
    (₁ Γᴾ)
  , ₂ Γᴾ
