
{-# OPTIONS --rewriting #-}

module Glued where

open import StrictLib hiding (id; _∘_)
import Syntax as S

infixl 5 _▶_
infixl 7 _[_]T
infixl 5 _,s_
infix  6 _∘_
infixl 8 _[_]t
infixl 5 _^_


--   Con : ∀ i → S.Con i → Set (suc i)
--   Ty  : ∀ {j}{Γˢ : S.Con j}(Γ : Con j Γˢ) i → S.Ty Γˢ i → Set (suc i ⊔ j)
--   ∙   : Con zero S.∙
--   _▶_   : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
--             {j}{Aˢ : S.Ty Γˢ j}(A : Ty Γ j Aˢ)
--             → Con (i ⊔ j) (Γˢ S.▶ Aˢ)

--   Sub   : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
--             {j}{Δˢ : S.Con j}(Δ : Con j Δˢ)
--             → S.Sub Γˢ Δˢ → Set (i ⊔ j)

--   Tm  : ∀ {i}{Γˢ : S.Con i}(Γ : Con i Γˢ)
--             {j}{Aˢ : S.Ty Γˢ j}(A : Ty Γ j Aˢ) → S.Tm Γˢ Aˢ → Set (i ⊔ j)

--   _[_]T :
--     ∀ {i}{Δˢ : S.Con i}   {Δ : Con i Δˢ}
--       {j}{Aˢ : S.Ty Δˢ j} (A : Ty Δ j Aˢ)
--       {k}{Γˢ : S.Con k}   {Γ : Con k Γˢ}
--       {σˢ : S.Sub Γˢ Δˢ}  (σ : Sub Γ Δ σˢ)
--       → Ty Γ j (Aˢ S.[ σˢ ]T)

--   id : ∀{i}{Γˢ : S.Con i}{Γ : Con i Γˢ} → Sub Γ Γ S.id

--   _∘_ :
--     ∀{i}{θˢ : S.Con i}     {θ : Con _ θˢ}
--      {j}{Δˢ : S.Con j}     {Δ : Con _ Δˢ}
--         {σˢ : S.Sub θˢ Δˢ} (σ : Sub θ Δ σˢ)
--      {k}{Γˢ : S.Con k}     {Γ : Con _ Γˢ}
--         {δˢ : S.Sub Γˢ θˢ} (δ : Sub Γ θ δˢ)
--     → Sub Γ Δ (σˢ S.∘ δˢ)

--   ε : ∀{i}{Γˢ : S.Con i}{Γ : Con i Γˢ}
--       → Sub Γ ∙ S.ε

--   _,s_ :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level}
--     {Δˢ : S.Con j} {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ}
--     (σ : Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ) {k : Level} {Aˢ : S.Ty {j} Δˢ k}
--     {A : Ty {j} {Δˢ} Δ k Aˢ}
--     {tˢ : S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} →
--     Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ}
--     (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ →
--     Sub {i} {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ}
--     (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A)
--     (S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k} {Aˢ} tˢ)

--   π₁ :
--     ∀{i}{Γˢ : S.Con i}                {Γ : Con _ Γˢ}
--      {j}{Δˢ : S.Con j}                {Δ : Con _ Δˢ}
--      {k}{Aˢ : S.Ty Δˢ k}              {A : Ty Δ _ Aˢ}
--         {σˢ : S.Sub Γˢ (Δˢ S.▶ Aˢ)}   (σ : Sub Γ (Δ ▶ A) σˢ)
--     → Sub Γ Δ (S.π₁ σˢ)

--   π₂ :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k
--      Aˢ} {σˢ : S.Sub {i} Γˢ {j ⊔ k} (S._▶_ {j} Δˢ {k} Aˢ)} (σ : Sub {i}
--      {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) σˢ) →
--      Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} (S.π₁ {i} {Γˢ} {j}
--      {Δˢ} {k} {Aˢ} σˢ)} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {S.π₁
--      {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ}
--      {A} {σˢ} σ)) (S.π₂ {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ)

--   _[_]t :
--     {i : Level} {Δˢ : S.Con i} {Δ : Con i Δˢ} {j : Level} {Aˢ : S.Ty {i}
--     Δˢ j} {A : Ty {i} {Δˢ} Δ j Aˢ} {tˢ : S.Tm {i} Δˢ {j} Aˢ} → Tm {i} {Δˢ}
--     Δ {j} {Aˢ} A tˢ → {k : Level} {Γˢ : S.Con k} {Γ : Con k Γˢ} {σˢ :
--     S.Sub {k} Γˢ {i} Δˢ} (σ : Sub {k} {Γˢ} Γ {i} {Δˢ} Δ σˢ) → Tm {k} {Γˢ}
--     Γ {j} {S._[_]T {i} {Δˢ} {j} Aˢ {k} {Γˢ} σˢ} (_[_]T {i} {Δˢ} {Δ} {j}
--     {Aˢ} A {k} {Γˢ} {Γ} {σˢ} σ) (S._[_]t {i} {Δˢ} {j} {Aˢ} tˢ {k} {Γˢ} σˢ)

--   ∙η :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {σˢ : S.Sub {i} Γˢ {zero}
--     S.∙} {σ : Sub {i} {Γˢ} Γ {zero} {S.∙} ∙ σˢ} → _≡_ {i} {Sub {i} {Γˢ} Γ
--     {zero} {S.∙} ∙ (S.ε {i} {Γˢ})} (tr {i} {i} {S.Sub {i} Γˢ {zero} S.∙}
--     (Sub {i} {Γˢ} Γ {zero} {S.∙} ∙) {σˢ} {S.ε {i} {Γˢ}} (S.∙η {i} {Γˢ}
--     {σˢ}) σ) (ε {i} {Γˢ} {Γ})

--   [id]T :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Aˢ : S.Ty {i}
--      Γˢ j} {A : Ty {i} {Γˢ} Γ j Aˢ} → _≡_ {i ⊔ suc j} {Ty {i} {Γˢ} Γ j Aˢ}
--      (_[_]T {i} {Γˢ} {Γ} {j} {Aˢ} A {i} {Γˢ} {Γ} {S.id {i} {Γˢ}} (id {i}
--      {Γˢ} {Γ})) A

--   [∘]T :
--     {i : Level} {θˢ : S.Con i} {θ : Con i θˢ} {j : Level} {Δˢ : S.Con j}
--     {Δ : Con j Δˢ} {σˢ : S.Sub {i} θˢ {j} Δˢ} {σ : Sub {i} {θˢ} θ {j} {Δˢ}
--     Δ σˢ} {k : Level} {Γˢ : S.Con k} {Γ : Con k Γˢ} {δˢ : S.Sub {k} Γˢ {i}
--     θˢ} {δ : Sub {k} {Γˢ} Γ {i} {θˢ} θ δˢ} {l : Level} {Aˢ : S.Ty {j} Δˢ
--     l} {A : Ty {j} {Δˢ} Δ l Aˢ} → _≡_ {k ⊔ suc l} {Ty {k} {Γˢ} Γ l
--     (S._[_]T {j} {Δˢ} {l} Aˢ {k} {Γˢ} (S._∘_ {i} {θˢ} {j} {Δˢ} σˢ {k} {Γˢ}
--     δˢ))} (_[_]T {j} {Δˢ} {Δ} {l} {Aˢ} A {k} {Γˢ} {Γ} {S._∘_ {i} {θˢ} {j}
--     {Δˢ} σˢ {k} {Γˢ} δˢ} (_∘_ {i} {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Γˢ}
--     {Γ} {δˢ} δ)) (_[_]T {i} {θˢ} {θ} {l} {S._[_]T {j} {Δˢ} {l} Aˢ {i} {θˢ}
--     σˢ} (_[_]T {j} {Δˢ} {Δ} {l} {Aˢ} A {i} {θˢ} {θ} {σˢ} σ) {k} {Γˢ} {Γ}
--     {δˢ} δ)

--   idl :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--     {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--     Δ σˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ} (_∘_ {j} {Δˢ} {Δ}
--     {j} {Δˢ} {Δ} {S.id {j} {Δˢ}} (id {j} {Δˢ} {Δ}) {i} {Γˢ} {Γ} {σˢ} σ) σ

--   idr :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--     {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--     Δ σˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j} {Δˢ} Δ σˢ} (_∘_ {i} {Γˢ} {Γ}
--     {j} {Δˢ} {Δ} {σˢ} σ {i} {Γˢ} {Γ} {S.id {i} {Γˢ}} (id {i} {Γˢ} {Γ})) σ

--   ass :
--     {i : Level} {θˢ : S.Con i} {θ : Con i θˢ} {j : Level} {Δˢ : S.Con j}
--     {Δ : Con j Δˢ} {σˢ : S.Sub {i} θˢ {j} Δˢ} {σ : Sub {i} {θˢ} θ {j} {Δˢ}
--     Δ σˢ} {k : Level} {Ξˢ : S.Con k} {Ξ : Con k Ξˢ} {δˢ : S.Sub {k} Ξˢ {i}
--     θˢ} {δ : Sub {k} {Ξˢ} Ξ {i} {θˢ} θ δˢ} {l : Level} {Γˢ : S.Con l} {Γ :
--     Con l Γˢ} {νˢ : S.Sub {l} Γˢ {k} Ξˢ} {ν : Sub {l} {Γˢ} Γ {k} {Ξˢ} Ξ
--     νˢ} → _≡_ {j ⊔ l} {Sub {l} {Γˢ} Γ {j} {Δˢ} Δ (S._∘_ {i} {θˢ} {j} {Δˢ}
--     σˢ {l} {Γˢ} (S._∘_ {k} {Ξˢ} {i} {θˢ} δˢ {l} {Γˢ} νˢ))} (_∘_ {k} {Ξˢ}
--     {Ξ} {j} {Δˢ} {Δ} {S._∘_ {i} {θˢ} {j} {Δˢ} σˢ {k} {Ξˢ} δˢ} (_∘_ {i}
--     {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Ξˢ} {Ξ} {δˢ} δ) {l} {Γˢ} {Γ} {νˢ} ν)
--     (_∘_ {i} {θˢ} {θ} {j} {Δˢ} {Δ} {σˢ} σ {l} {Γˢ} {Γ} {S._∘_ {k} {Ξˢ} {i}
--     {θˢ} δˢ {l} {Γˢ} νˢ} (_∘_ {k} {Ξˢ} {Ξ} {i} {θˢ} {θ} {δˢ} δ {l} {Γˢ}
--     {Γ} {νˢ} ν))

--   ▶β₁ :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--      Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
--      S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
--      {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
--      {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} → _≡_ {i ⊔ j} {Sub {i} {Γˢ} Γ {j}
--      {Δˢ} Δ σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ}
--      {j} {Δˢ} σˢ {k} {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k}
--      {Aˢ} {A} {tˢ} t)) σ

--   ▶β₂ :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--      Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
--      S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
--      {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
--      {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} → _≡_ {i ⊔ k} {Tm {i} {Γˢ} Γ {k}
--      {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A
--      {i} {Γˢ} {Γ} {σˢ} σ) tˢ} (tr {i ⊔ j} {i ⊔ k} {Sub {i} {Γˢ} Γ {j} {Δˢ}
--      Δ σˢ} (λ x → Tm {i} {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ}
--      (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} x) tˢ) {π₁ {i} {Γˢ}
--      {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k} {Aˢ}
--      tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} {A} {tˢ} t)} {σ}
--      (▶β₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} {σ} {k} {Aˢ} {A} {tˢ} {t}) (π₂ {i}
--      {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {S._,s_ {i} {Γˢ} {j} {Δˢ} σˢ {k}
--      {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} {A} {tˢ} t)))
--      t

--   ▶η :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k
--      Aˢ} {σˢ : S.Sub {i} Γˢ {j ⊔ k} (S._▶_ {j} Δˢ {k} Aˢ)} (σ : Sub {i}
--      {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) σˢ) →
--      _≡_ {i ⊔ (j ⊔ k)} {Sub {i} {Γˢ} Γ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ} (_▶_
--      {j} {Δˢ} Δ {k} {Aˢ} A) σˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {S.π₁ {i}
--      {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₁ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A}
--      {σˢ} σ) {k} {Aˢ} {A} {S.π₂ {i} {Γˢ} {j} {Δˢ} {k} {Aˢ} σˢ} (π₂ {i} {Γˢ}
--      {Γ} {j} {Δˢ} {Δ} {k} {Aˢ} {A} {σˢ} σ)) σ

--   ,∘ :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--      Δ σˢ} {k : Level} {Aˢ : S.Ty {j} Δˢ k} {A : Ty {j} {Δˢ} Δ k Aˢ} {tˢ :
--      S.Tm {i} Γˢ {k} (S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ)} {t : Tm {i}
--      {Γˢ} Γ {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ} {Δ}
--      {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) tˢ} {l : Level} {θˢ : S.Con l} {θ :
--      Con l θˢ} {δˢ : S.Sub {l} θˢ {i} Γˢ} {δ : Sub {l} {θˢ} θ {i} {Γˢ} Γ
--      δˢ} → _≡_ {j ⊔ (k ⊔ l)} {Sub {l} {θˢ} θ {j ⊔ k} {S._▶_ {j} Δˢ {k} Aˢ}
--      (_▶_ {j} {Δˢ} Δ {k} {Aˢ} A) (S._,s_ {l} {θˢ} {j} {Δˢ} (S._∘_ {i} {Γˢ}
--      {j} {Δˢ} σˢ {l} {θˢ} δˢ) {k} {Aˢ} (S._[_]t {i} {Γˢ} {k} {S._[_]T {j}
--      {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l} {θˢ} δˢ))} (_∘_ {i} {Γˢ} {Γ} {j ⊔ k}
--      {S._▶_ {j} Δˢ {k} Aˢ} {_▶_ {j} {Δˢ} Δ {k} {Aˢ} A} {S._,s_ {i} {Γˢ} {j}
--      {Δˢ} σˢ {k} {Aˢ} tˢ} (_,s_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ}
--      {A} {tˢ} t) {l} {θˢ} {θ} {δˢ} δ) (_,s_ {l} {θˢ} {θ} {j} {Δˢ} {Δ}
--      {S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ}
--      {Δ} {σˢ} σ {l} {θˢ} {θ} {δˢ} δ) {k} {Aˢ} {A} {S._[_]t {i} {Γˢ} {k}
--      {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l} {θˢ} δˢ} (tr {suc k ⊔ l}
--      {k ⊔ l} {Ty {l} {θˢ} θ k (S._[_]T {j} {Δˢ} {k} Aˢ {l} {θˢ} (S._∘_ {i}
--      {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ))} (λ x → Tm {l} {θˢ} θ {k} {S._[_]T {j}
--      {Δˢ} {k} Aˢ {l} {θˢ} (S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ)} x
--      (S._[_]t {i} {Γˢ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} tˢ {l}
--      {θˢ} δˢ)) {_[_]T {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ}
--      σˢ} (_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) {l} {θˢ} {θ}
--      {δˢ} δ} {_[_]T {j} {Δˢ} {Δ} {k} {Aˢ} A {l} {θˢ} {θ} {S._∘_ {i} {Γˢ}
--      {j} {Δˢ} σˢ {l} {θˢ} δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {l}
--      {θˢ} {θ} {δˢ} δ)} (_⁻¹ {suc k ⊔ l} {Ty {l} {θˢ} θ k (S._[_]T {j} {Δˢ}
--      {k} Aˢ {l} {θˢ} (S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ} δˢ))} {_[_]T {j}
--      {Δˢ} {Δ} {k} {Aˢ} A {l} {θˢ} {θ} {S._∘_ {i} {Γˢ} {j} {Δˢ} σˢ {l} {θˢ}
--      δˢ} (_∘_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {l} {θˢ} {θ} {δˢ} δ)} {_[_]T
--      {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} (_[_]T {j} {Δˢ}
--      {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ) {l} {θˢ} {θ} {δˢ} δ} ([∘]T {i}
--      {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} {σ} {l} {θˢ} {θ} {δˢ} {δ} {k} {Aˢ} {A}))
--      (_[_]t {i} {Γˢ} {Γ} {k} {S._[_]T {j} {Δˢ} {k} Aˢ {i} {Γˢ} σˢ} {_[_]T
--      {j} {Δˢ} {Δ} {k} {Aˢ} A {i} {Γˢ} {Γ} {σˢ} σ} {tˢ} t {l} {θˢ} {θ} {δˢ}
--      δ)))

-- wk :
--   ∀{i}{Γˢ : S.Con i}                {Γ : Con _ Γˢ}
--    {k}{Aˢ : S.Ty Γˢ k}              {A : Ty Γ _ Aˢ}
--   → Sub (Γ ▶ A) Γ (S.wk {Γ = Γˢ})
-- wk = π₁ id

-- vz :
--   ∀{i}{Γˢ : S.Con i}                {Γ : Con _ Γˢ}
--    {k}{Aˢ : S.Ty Γˢ k}              {A : Ty Γ _ Aˢ}
--   → Tm (Γ ▶ A) (A [ wk ]T) S.vz
-- vz = π₂ id

-- _^_ :
--   ∀{i}{Γˢ : S.Con i}                {Γ : Con _ Γˢ}
--    {j}{Δˢ : S.Con j}                {Δ : Con _ Δˢ}
--       {σˢ : S.Sub Γˢ Δˢ}            (σ : Sub Γ Δ σˢ)
--    {k}{Aˢ : S.Ty Δˢ k}              (A : Ty Δ k Aˢ)
--   → Sub (Γ ▶ A [ σ ]T) (Δ ▶ A) (σˢ S.^ Aˢ)
-- _^_ {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} σ {k} {Aˢ} A =
--   σ ∘ wk ,s tr (λ x → Tm (Γ ▶ A [ σ ]T) x _) ([∘]T ⁻¹) (vz {A = A [ σ ]T})

-- postulate
--   Π :
--     ∀{i}{Γˢ : S.Con i}            {Γ : Con _ Γˢ}
--      {j}{Aˢ : S.Ty Γˢ j}          (A : Ty Γ _ Aˢ)
--      {k}{Bˢ : S.Ty (Γˢ S.▶ Aˢ) k} (B : Ty (Γ ▶ A) _ Bˢ)
--      → Ty Γ (j ⊔ k) (S.Π Aˢ Bˢ)

--   Π[] :
--     ∀{i}{Γˢ : S.Con i}           {Γ : Con _ Γˢ}
--      {j}{Aˢ : S.Ty Γˢ j}         {A : Ty Γ _ Aˢ}
--      {k}{Bˢ : S.Ty (Γˢ S.▶ Aˢ) k}{B : Ty (Γ ▶ A) _ Bˢ}
--      {l}{θˢ : S.Con l}           {θ : Con _ θˢ}
--         {σˢ : S.Sub θˢ Γˢ}       {σ : Sub θ Γ σˢ}
--     → Π A B [ σ ]T ≡ Π (A [ σ ]T) (B [ σ ^ A ]T)

--   lam :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Aˢ : S.Ty {i}
--      Γˢ j} {A : Ty {i} {Γˢ} Γ j Aˢ} {k : Level} {Bˢ : S.Ty {i ⊔ j} (S._▶_
--      {i} Γˢ {j} Aˢ) k} {B : Ty {i ⊔ j} {S._▶_ {i} Γˢ {j} Aˢ} (_▶_ {i} {Γˢ}
--      Γ {j} {Aˢ} A) k Bˢ} {tˢ : S.Tm {i ⊔ j} (S._▶_ {i} Γˢ {j} Aˢ) {k} Bˢ} →
--      Tm {i ⊔ j} {S._▶_ {i} Γˢ {j} Aˢ} (_▶_ {i} {Γˢ} Γ {j} {Aˢ} A) {k} {Bˢ}
--      B tˢ → Tm {i} {Γˢ} Γ {j ⊔ k} {S.Π {i} {Γˢ} {j} Aˢ {k} Bˢ} (Π {i} {Γˢ}
--      {Γ} {j} {Aˢ} A {k} {Bˢ} B) (S.lam {i} {Γˢ} {j} {Aˢ} {k} {Bˢ} tˢ)

--   app :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Aˢ : S.Ty {i}
--      Γˢ j} {A : Ty {i} {Γˢ} Γ j Aˢ} {k : Level} {Bˢ : S.Ty {i ⊔ j} (S._▶_
--      {i} Γˢ {j} Aˢ) k} {B : Ty {i ⊔ j} {S._▶_ {i} Γˢ {j} Aˢ} (_▶_ {i} {Γˢ}
--      Γ {j} {Aˢ} A) k Bˢ} {tˢ : S.Tm {i} Γˢ {j ⊔ k} (S.Π {i} {Γˢ} {j} Aˢ {k}
--      Bˢ)} → Tm {i} {Γˢ} Γ {j ⊔ k} {S.Π {i} {Γˢ} {j} Aˢ {k} Bˢ} (Π {i} {Γˢ}
--      {Γ} {j} {Aˢ} A {k} {Bˢ} B) tˢ → Tm {i ⊔ j} {S._▶_ {i} Γˢ {j} Aˢ} (_▶_
--      {i} {Γˢ} Γ {j} {Aˢ} A) {k} {Bˢ} B (S.app {i} {Γˢ} {j} {Aˢ} {k} {Bˢ}
--      tˢ)

--   app[] :
--     ∀{i}{Γˢ : S.Con i}            {Γ : Con _ Γˢ}
--      {l}{Δˢ : S.Con l}            {Δ : Con _ Δˢ}
--         {σˢ : S.Sub Γˢ Δˢ}        {σ : Sub Γ Δ σˢ}
--      {j}{Aˢ : S.Ty Δˢ j}          {A : Ty Δ _ Aˢ}
--      {k}{Bˢ : S.Ty (Δˢ S.▶ Aˢ) k} {B : Ty (Δ ▶ A) _ Bˢ}
--         {tˢ : S.Tm Δˢ (S.Π Aˢ Bˢ)}(t : Tm Δ (Π A B) tˢ)
--     → (app t) [ σ ^ A ]t ≡ app (tr (λ x → Tm Γ x (tˢ S.[ σˢ ]t)) Π[] (t [ σ ]t))

--   Πβ :
--     ∀{i}{Γˢ : S.Con i}            {Γ : Con _ Γˢ}
--      {j}{Aˢ : S.Ty Γˢ j}          {A : Ty Γ _ Aˢ}
--      {k}{Bˢ : S.Ty (Γˢ S.▶ Aˢ) k} {B : Ty (Γ ▶ A) _ Bˢ}
--         {tˢ : S.Tm (Γˢ S.▶ Aˢ) Bˢ}{t : Tm (Γ ▶ A) B tˢ}
--     → app (lam t) ≡ t

--   Πη :
--     ∀{i}{Γˢ : S.Con i}            {Γ : Con _ Γˢ}
--      {j}{Aˢ : S.Ty Γˢ j}          {A : Ty Γ _ Aˢ}
--      {k}{Bˢ : S.Ty (Γˢ S.▶ Aˢ) k} {B : Ty (Γ ▶ A) _ Bˢ}
--         {tˢ : S.Tm Γˢ (S.Π Aˢ Bˢ)}{t : Tm Γ (Π A B) tˢ}
--     → lam (app t) ≡ t

-- --------------------------------------------------------------------------------

--   U :
--     ∀{i}{Γˢ : S.Con i}{Γ : Con _ Γˢ} j → Ty Γ (suc j) (S.U j)

--   U[] :
--      {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--      {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--      Δ σˢ} {k : Level} → _≡_ {i ⊔ suc (suc k)} {Ty {i} {Γˢ} Γ (suc k) (S.U
--      {i} {Γˢ} k)} (_[_]T {j} {Δˢ} {Δ} {suc k} {S.U {j} {Δˢ} k} (U {j} {Δˢ}
--      {Δ} k) {i} {Γˢ} {Γ} {σˢ} σ) (U {i} {Γˢ} {Γ} k)

--   El :
--     ∀{i}{Γˢ : S.Con i}         {Γ : Con _ Γˢ}
--      {j}{aˢ : S.Tm Γˢ (S.U j)} (a : Tm Γ (U j) aˢ)
--      → Ty Γ j (S.El aˢ)

--   El[] :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Δˢ : S.Con j}
--     {Δ : Con j Δˢ} {σˢ : S.Sub {i} Γˢ {j} Δˢ} {σ : Sub {i} {Γˢ} Γ {j} {Δˢ}
--     Δ σˢ} {k : Level} {aˢ : S.Tm {j} Δˢ {suc k} (S.U {j} {Δˢ} k)} {a : Tm
--     {j} {Δˢ} Δ {suc k} {S.U {j} {Δˢ} k} (U {j} {Δˢ} {Δ} k) aˢ} → _≡_ {i ⊔
--     suc k} {Ty {i} {Γˢ} Γ k (S.El {i} {Γˢ} {k} (S._[_]t {j} {Δˢ} {suc k}
--     {S.U {j} {Δˢ} k} aˢ {i} {Γˢ} σˢ))} (_[_]T {j} {Δˢ} {Δ} {k} {S.El {j}
--     {Δˢ} {k} aˢ} (El {j} {Δˢ} {Δ} {k} {aˢ} a) {i} {Γˢ} {Γ} {σˢ} σ) (El {i}
--     {Γˢ} {Γ} {k} {S._[_]t {j} {Δˢ} {suc k} {S.U {j} {Δˢ} k} aˢ {i} {Γˢ}
--     σˢ} (tr {i ⊔ suc (suc k)} {i ⊔ suc k} {Ty {i} {Γˢ} Γ (suc k) (S.U {i}
--     {Γˢ} k)} (λ x → Tm {i} {Γˢ} Γ {suc k} {S.U {i} {Γˢ} k} x (S._[_]t {j}
--     {Δˢ} {suc k} {S.U {j} {Δˢ} k} aˢ {i} {Γˢ} σˢ)) {_[_]T {j} {Δˢ} {Δ}
--     {suc k} {S.U {j} {Δˢ} k} (U {j} {Δˢ} {Δ} k) {i} {Γˢ} {Γ} {σˢ} σ} {U
--     {i} {Γˢ} {Γ} k} (U[] {i} {Γˢ} {Γ} {j} {Δˢ} {Δ} {σˢ} {σ} {k}) (_[_]t
--     {j} {Δˢ} {Δ} {suc k} {S.U {j} {Δˢ} k} {U {j} {Δˢ} {Δ} k} {aˢ} a {i}
--     {Γˢ} {Γ} {σˢ} σ)))

--   c :
--     ∀{i}{Γˢ : S.Con i}  {Γ : Con _ Γˢ}
--      {j}{Aˢ : S.Ty Γˢ j}(A : Ty Γ _ Aˢ)
--     → Tm Γ (U j) (S.c Aˢ)

--   Elc :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {Aˢ : S.Ty {i}
--     Γˢ j} {A : Ty {i} {Γˢ} Γ j Aˢ} → _≡_ {i ⊔ suc j} {Ty {i} {Γˢ} Γ j Aˢ}
--     (El {i} {Γˢ} {Γ} {j} {S.c {i} {Γˢ} {j} Aˢ} (c {i} {Γˢ} {Γ} {j} {Aˢ}
--     A)) A

--   cEl :
--     {i : Level} {Γˢ : S.Con i} {Γ : Con i Γˢ} {j : Level} {aˢ : S.Tm {i}
--     Γˢ {suc j} (S.U {i} {Γˢ} j)} {a : Tm {i} {Γˢ} Γ {suc j} {S.U {i} {Γˢ}
--     j} (U {i} {Γˢ} {Γ} j) aˢ} → _≡_ {i ⊔ suc j} {Tm {i} {Γˢ} Γ {suc j}
--     {S.U {i} {Γˢ} j} (U {i} {Γˢ} {Γ} j) aˢ} (c {i} {Γˢ} {Γ} {j} {S.El {i}
--     {Γˢ} {j} aˢ} (El {i} {Γˢ} {Γ} {j} {aˢ} a)) a
